# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Development kit for the Java programming language
brew "openjdk@21"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Tool for managing OCI containers and pods
brew "podman"
# Theme for zsh
brew "powerlevel10k"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Terminal emulator for the X Window System
brew "xterm"
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Discover, download, and run local LLMs
cask "lm-studio"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
